// สร้างแมพ ตั้งค่าตามกรอบที่สร้าง
const map = L.map("map", {
    center: [18.789735993315354, 98.98515632359728],
    zoom: 8
})

// เรียกให้มันดึงข้อมูลแมพตามลิ้ง
var CyclOSM = L.tileLayer('https://{s}.tile-cyclosm.openstreetmap.fr/cyclosm/{z}/{x}/{y}.png', {
    maxZoom: 20,
    attribution: '<a href="https://github.com/cyclosm/cyclosm-cartocss-style/releases" title="CyclOSM - Open Bicycle render">CyclOSM</a> | Map data: &copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
});

const osm = L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png')

var Esri_WorldImagery = L.tileLayer('https://server.arcgisonline.com/ArcGIS/rest/services/World_Imagery/MapServer/tile/{z}/{y}/{x}', {
    attribution: 'Tiles &copy; Esri &mdash; Source: Esri, i-cubed, USDA, USGS, AEX, GeoEye, Getmapping, Aerogrid, IGN, IGP, UPR-EGP, and the GIS User Community'
});
var OpenTopoMap = L.tileLayer('https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png', {
    maxZoom: 17,
    attribution: 'Map data: &copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors, <a href="http://viewfinderpanoramas.org">SRTM</a> | Map style: &copy; <a href="https://opentopomap.org">OpenTopoMap</a> (<a href="https://creativecommons.org/licenses/by-sa/3.0/">CC-BY-SA</a>)'
});

var Googlemap = L.tileLayer('https://mt1.google.com/vt/lyrs=r&x={x}&y={y}&z={z}', {
    maxZoom: 17,
    attribution: 'Google'
});


// wms เรียกเลเยอร์
var amphoe = L.tileLayer.wms("https://engrids.soc.cmu.ac.th/geoserver/CM/wms?", {
    layers: "CM:amphoe_cm",
    format: "image/png",
    transparent: true

})




//addmap
// osm.addTo(map)
// Esri_WorldImagery.addTo(map)
// OpenTopoMap.addTo(map)
// addmapจากGeoserver
// amphoe.addTo(map)
// village.addTo(map)


// เพิ่มปุ่มเลือกเลเยอร์แผนที่
var basemap = {
    "แผนที่แสดงเส้นชันความสูง": CyclOSM.addTo(map),
    "แผนที่ WorldImagery": Esri_WorldImagery,
    "แผนที่ OpenTopoMap": OpenTopoMap,
    "แผนที่ osm": osm,
    "แผนที่ Google Map": Googlemap
}



// มาคเกอร์
var mk1 = L.marker([18.79084883016422, 98.97400993441511], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B> โรงพยาบาลมหาราชนครเชียงใหม่</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 110 ถนนอินทวโรรส ซอย 2 ตำบลสุเทพ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200 <B>หมายเลขโทรศัพท์:</B>053936150")


var mk2 = L.marker([18.780280424170677, 98.98838647465251], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงใหม่ เมดิคอล เซ็นเตอร์</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 21 ถนน นันทาราม ตำบล หายยา อำเภอเมืองเชียงใหม่ เชียงใหม่ 50100 <B>หมายเลขโทรศัพท์:</B>053270145 ")

var mk3 = L.marker([18.79479651073225, 98.9778541898725], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงใหม่ ราม</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> ตําบล ศรีภูมิ 8 ถนน บุญเรืองฤทธิ์ ตำบลสุเทพ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200 <B>หมายเลขโทรศัพท์:</B>053920300")

var mk4 = L.marker([18.810671663530123, 98.98109833064564], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงใหม่ ฮอสพิทอล</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>84/3 ถ. ซุปเปอร์ไฮเวย์ เชียงใหม่-ลำปาง ตำบลช้างเผือก เมือง เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B>053225222")

var mk5 = L.marker([18.798807305900286, 98.98676231249443], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเทพปัญญา 2 </B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>1 7 ช้างเผือก ซอย 2 ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200 <B>หมายเลขโทรศัพท์:</B>053220022")

var mk6 = L.marker([18.77296527198497, 98.99843127852994], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเซ็นทรัลเชียงใหม่ เมโมเรียล </B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>186 อ, 2 ถ. ช้างคลาน ตำบลช้างคลาน อำเภอเมืองเชียงใหม่ เชียงใหม่ 50100 <B>หมายเลขโทรศัพท์:</B>053819333")

var mk7 = L.marker([18.811970833197044, 98.99088488064933], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลลานนา</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 1 ถนน สุขเกษม ตำบลช้างเผือก อำเภอเมืองเชียงใหม่ เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B> 052134777")

var mk8 = L.marker([18.78856635490492, 99.001867774517], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเทศบาลนครเชียงใหม่ </B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 8.30-16.30 น. <br> <B>พิกัด:</B>โรงพยาบาลเทศบาลนครเชียงใหม่ 18-19 ถนน วิชยานนท์ ตำบล ช้างม่อย อำเภอเมืองเชียงใหม่ เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B> 053233114")

var mk9 = L.marker([18.798315568245446, 99.01079771438856], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแมคคอร์มิค </B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 133 ถนน แก้วนวรัฐ ตำบล วัดเกตุ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 053921777 ")

var mk10 = L.marker([18.790032365725466, 98.97079635071543], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>ศูนย์ศรีพัฒน์ คณะแพทยศาสตร์ มหาวิทยาลัยเชียงใหม่ </B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 6.30-20.00 น. <br> <B>พิกัด:</B>110 392 ถนนศิริมังคลาจารย์ ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200  <B>หมายเลขโทรศัพท์:</B>  053936900 ")

var mk11 = L.marker([18.85182147113579, 98.96818187476087], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลนครพิงค์</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>159 หมู่ที่ 10 ตำบล ดอนแก้ว อำเภอแม่ริม เชียงใหม่ 50180 <B>หมายเลขโทรศัพท์:</B> 053999200")

var mk12 = L.marker([18.760617086800934, 98.97216820712136], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงใหม่ใกล้หมอ</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>157/16-19 ถนน เชียงใหม่-ฮอด ตำบลป่าแดด อำเภอเมืองเชียงใหม่ เชียงใหม่ 50100 <B>หมายเลขโทรศัพท์:</B> 053200002")

var mk13 = L.marker([18.810504628363553, 99.01131652720754], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเทพปัญญา</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>99 หมู่ที่ 5 ถนน เชียงใหม่-ลำปาง ตำบล ฟ้าฮ่าม อำเภอ เมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 052088999")

var mk14 = L.marker([18.869905567943892, 99.12804419203933], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลดอยสะเก็ด</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>2 หมู่ 8 ตำบล เชิงดอย อำเภอดอยสะเก็ด เชียงใหม่ 50220 <B>หมายเลขโทรศัพท์:</B> 053495166")

var mk15 = L.marker([18.920937076411885, 98.99412941355735], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลสันทราย</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 7.00-20.00 น. <br> <B>พิกัด:201 หมู่ที่ 11 ถนน เชียงใหม่ - พร้าว อำเภอสันทราย เชียงใหม่ 50290</B> <B>หมายเลขโทรศัพท์:</B> 053921199")

var mk16 = L.marker([18.823215524106764, 98.96230804906045], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงแสน</B> <br> <B>เวลาเปิด-ปิด:</B> ไม่มีข้อมูล <br> <B>พิกัด:</B>ตำบลช้างเผือก อำเภอเมืองเชียงใหม่ เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B> ไม่มีข้อมูล")

var mk17 = L.marker([18.78849370136209, 99.02636993744345], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลกรุงเทพ เชียงใหม่</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>88/8-9 ถ. ซุปเปอร์ไฮเวย์ เชียงใหม่-ลำปาง ตำบลหนองป่าครั่ง อำเภอเมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 052089888")

var mk18 = L.marker([18.81548303015394, 98.99414249123146], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลลานนา3 (Lanna 3 Hospital)</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>1 2 ถนน สุขเกษม ตำบลช้างเผือก เมือง เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B> 052015999")

var mk19 = L.marker([18.76692183025128, 99.00431179832886], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลราชเวช เชียงใหม่</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>316/1 ถ. เชียงใหม่-ลำพูน ตำบลวัดเกต อำเภอเมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 052011999")

var mk20 = L.marker([18.728515776974348, 98.98663542487812], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแมคเคน</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>หมู่ที่ 8 68-69 ตำบลป่าแดด อำเภอเมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 053817170")

var mk21 = L.marker([18.856859162905025, 98.97038332571354], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลชุมชนตำบลดอนแก้ว</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> ตำบลดอนแก้ว อำเภอแม่ริม เชียงใหม่ 50180 <B>หมายเลขโทรศัพท์:</B> 053121572")

var mk22 = L.marker([18.77797803025192, 99.01442103756354], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลค่ายกาวิละ</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>ค่ายทหารกาวิละ 285 ซอย หน้าวัดเกตุ ตำบล วัดเกตุ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50000 <B>หมายเลขโทรศัพท์:</B> 053245784")

var mk23 = L.marker([18.773252679298146, 98.99450719800703], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลส่งเสริมสุขภาพเชียงใหม่ (โรงพยาบาลแม่และเด็กจังหวัดเชียงใหม่)</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>51 ซอย ถนนประชาสัมพันธ์ ตำบลช้างคลาน อำเภอเมืองเชียงใหม่ เชียงใหม่ 50100 <B>หมายเลขโทรศัพท์:</B> 053276856")

var mk24 = L.marker([18.810608620876867, 98.98143801174739], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลสยามราษฎร์เชียงใหม่</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>84/3 ต.ช้างเผือก อ.เมือง เชียงใหม่ 50300 <B>หมายเลขโทรศัพท์:</B> 053421234")

var mk25 = L.marker([18.78991040662606, 98.96999582561595], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลประสาทเชียงใหม่</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>2 ถนน สุเทพ ตำบลสุเทพ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200 <B>หมายเลขโทรศัพท์:</B>053920200")

var mk26 = L.marker([18.780857309270722, 98.97923990164581], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลสวนปรุง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>131 ถนน ช่างหล่อ ตำบล หายยา อำเภอเมืองเชียงใหม่ เชียงใหม่ 50100 <B>หมายเลขโทรศัพท์:</B> 053908500")

var mk27 = L.marker([18.92089626293812, 98.99411597103439], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลนครพิงค์</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>201 หมู่ที่ 11 ถนน เชียงใหม่ - พร้าว อำเภอสันทราย เชียงใหม่ 50290 <B>หมายเลขโทรศัพท์:</B> 053921199")

var mk28 = L.marker([18.683077901540468, 98.91835617057285], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลหางดง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>ตำบลหางดง อำเภอหางดง เชียงใหม่ 50230 <B>หมายเลขโทรศัพท์:</B> 053442390")

var mk29 = L.marker([18.869068455461335, 99.12840299898866], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลดอยสะเก็ด</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>2 หมู่ 8 ตำบลเชิงดอย อำเภอดอยสะเก็ด เชียงใหม่ 50220 <B>หมายเลขโทรศัพท์:</B> 053495166")

var mk30 = L.marker([18.47776586961102, 98.78057253631192], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลดอยหล่อ</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>511 หมู่ 25 ถนนเชียงใหม่, Hot ตำบล ดอยหล่อ อำเภอ ดอยหล่อ เชียงใหม่ 50160 <B>หมายเลขโทรศัพท์:</B>  053267396")

var mk31 = L.marker([18.615975796739303, 98.77440000927541], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแม่วาง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>191 ตำบลบ้านกาด อำเภอแม่วาง เชียงใหม่ 50360 <B>หมายเลขโทรศัพท์:</B>053928044")

var mk32 = L.marker([18.743555979439233, 99.2219804082632], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแม่ออน</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> ตำบลบ้านสหกรณ์ อำเภอแม่ออน เชียงใหม่ 50130<B>หมายเลขโทรศัพท์:</B> 053880745")

var mk33 = L.marker([19.13753695111089, 98.96023738223163], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแม่แตง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>300 ตำบลสันมหาพน อำเภอแม่แตง เชียงใหม่ 50150 <B>หมายเลขโทรศัพท์:</B> 053104148")

var mk34 = L.marker([18.498047343860183, 98.37927515503918], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเทพรัตนเวชชานุกูล เฉลิมพระเกียรติ 60 พรรษา (โรงพยาบาลแม่แจ่ม)</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>11 ตำบล ช่างเคิ่ง อำเภอแม่แจ่ม เชียงใหม่ 50270 <B>หมายเลขโทรศัพท์:</B> 053485371")

var mk35 = L.marker([17.801982511811826, 98.36119371378872], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลอมก๋อย</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>262 ถนนเจริญทัศนา ตำบลอมก๋อย อำเภออมก๋อย เชียงใหม่ 50310 <B>หมายเลขโทรศัพท์:</B> 053467068")

var mk36 = L.marker([18.84668516446967, 98.7322065284972], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลอมก๋อย</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>1766 1269 ตำบลสะเมิงใต้ อำเภอสะเมิง เชียงใหม่ 50250 <B>หมายเลขโทรศัพท์:</B> 053487015")

var mk37 = L.marker([18.595603396588974, 98.88529974168722], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลสันป่าตอง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>149 ถนนเชียงใหม่-ฮอด ตำบล ยุหว่า อำเภอสันป่าตอง เชียงใหม่ 50120 <B>หมายเลขโทรศัพท์:</B>  -")

var mk38 = L.marker([18.715743788417235, 99.12277522692193], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลสันกำแพง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>129 ตำบลบวกค้าง อำเภอสันกำแพง เชียงใหม่ 50130 <B>หมายเลขโทรศัพท์:</B> 053446635")

var mk39 = L.marker([18.920876860988663, 98.99412552693761], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B></B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 7.00-20.00 น. <br> <B>พิกัด:</B>201 หมู่ที่ 11 ถนน เชียงใหม่ - พร้าว อำเภอสันทราย เชียงใหม่ 50290 <B>หมายเลขโทรศัพท์:</B>0 53921199")

var mk40 = L.marker([18.910809438769427, 98.94511509723912], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลดารารัศมี</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 08.30-16.30 น. <br> <B>พิกัด:</B>101 ตำบลริมใต้ อำเภอแม่ริม เชียงใหม่ 50180 <B>หมายเลขโทรศัพท์:</B> 053299167")

var mk41 = L.marker([19.36744776718338, 99.20012930320212], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลพร้าว</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>181 หมู่ที่ 4 ถนน โชตนาพร้าว-เชียงดาว ตำบลเวียง อำเภอพร้าว เชียงใหม่ 50190 <B>หมายเลขโทรศัพท์:</B> 053475271")


var mk42 = L.marker([18.743596584515927, 99.22199649992206], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแม่ออน</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> ตำบลบ้านสหกรณ์ อำเภอแม่ออน เชียงใหม่ 50130 <B>หมายเลขโทรศัพท์:</B>  053880745")

var mk43 = L.marker([18.178972745723385, 98.61176380006725], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลฮอด</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>  294 ตำบลหางดง อำเภอฮอด เชียงใหม่ 50240 <B>หมายเลขโทรศัพท์:</B> 053461095")

var mk44 = L.marker([17.95010127947186, 98.69106187102606], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลดอยเต่า</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>  105 ตำบลท่าเดื่อ อำเภอดอยเต่า เชียงใหม่ 50260 <B>หมายเลขโทรศัพท์:</B> 053469128")

var mk45 = L.marker([19.705611269132227, 99.136909740087], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลไชยปราการ</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>  131 ตำบลศรีดงเย็น อำเภอไชยปราการ เชียงใหม่ 50320 <B>หมายเลขโทรศัพท์:</B> 053870444")

var mk46 = L.marker([19.91335942519408, 99.20646347120763], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลฝาง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>  30 107, ตำบลเวียง อำเภอฝาง เชียงใหม่ 50110 <B>หมายเลขโทรศัพท์:</B> 053451144")

var mk47 = L.marker([20.038836801056277, 99.3023269423203], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลแม่อาย</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B>  191 หมู่ที่8 ตำบลแม่อาย อำเภอแม่อาย เชียงใหม่ 50280 <B>หมายเลขโทรศัพท์:</B> 053459036")

var mk48 = L.marker([19.077642303696514, 98.31588212865569], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลวัดจันทร์เฉลิมพระเกียรติ ๘๐ พรรษา</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 94 หมู่ที่3 ตำบลบ้านจันทร์ อำเภอกัลยาณิวัฒนา เชียงใหม่ 58130 <B>หมายเลขโทรศัพท์:</B> 053484010")

var mk49 = L.marker([19.55980197942429, 98.63509526940855], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเวียงแหง</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 53 หมู่3 ตำบลเมืองแหง อำเภอเวียงแหง เชียงใหม่ 50350 <B>หมายเลขโทรศัพท์:</B> 053477011")

var mk50 = L.marker([19.40296632243588, 98.97518857119874], { title: "aaa" })
    .addTo(map)
    .bindPopup("<B>โรงพยาบาลเชียงดาว</B> <br> <B>เวลาเปิด-ปิด:</B> เปิดทุกวัน 24 ชั่วโมง <br> <B>พิกัด:</B> 285 ถนนโชตนา ตำบลเชียงดาว อำเภอเชียงดาว เชียงใหม่ 50170 <B>หมายเลขโทรศัพท์:</B> 053455074")



var lyrGroup = L.layerGroup([mk1, mk2, mk3, mk4, mk5, mk6, mk7, mk8, mk9, mk10, mk11, mk12, mk13, mk14, mk15, mk16, mk17, mk18, mk19, mk20, mk21, mk22, mk23, mk24, mk25, mk26, mk27, mk28, mk29, mk30, mk31, mk32, mk33, mk34, mk35, mk35, mk36, mk37, mk38, mk39, mk40, mk41, mk42, mk43, mk45, mk46, mk47, mk48, mk49, mk50])

var overlayMaps = {
    "อำเภอ": amphoe.addTo(map),
    "โรงพยาบาล": lyrGroup.addTo(map)
}

L.control.layers(basemap, overlayMaps).addTo(map)

// ตัวเลือก
// document.getElementById("showButton").addEventListener("click", function () {
//     var selectElement = document.getElementById("selectOptions");
//     var selectedValue = selectElement.options[selectElement.selectedIndex].value;
//     document.getElementById("selectedValue").textContent = selectedValue;
// });


// นาฬิกาจับเวลา
var startTime, elapsedTime = 0, intervalId;
var isPaused = false;

document.getElementById("startButton").addEventListener("click", function () {
    if (isPaused) {
        startTime = new Date().getTime() - elapsedTime;
    } else {
        startTime = new Date().getTime();
    }
    intervalId = setInterval(updateTime, 1000); // อัปเดตทุก 1 วินาที
    isPaused = false;
});

document.getElementById("pauseButton").addEventListener("click", function () {
    clearInterval(intervalId);
    elapsedTime = new Date().getTime() - startTime;
    isPaused = true;
});

document.getElementById("clearButton").addEventListener("click", function () {
    clearInterval(intervalId);
    elapsedTime = 0;
    isPaused = false;
    document.getElementById("timeDisplay").textContent = "เวลาที่ผ่านไป: 00:00:00";
});

function updateTime() {
    var currentTime = new Date().getTime();
    elapsedTime = currentTime - startTime;

    var hours = Math.floor(elapsedTime / 3600000); // 3600000 มาจาก 1000 * 60 * 60 (1000 มิลลิวินาที * 60 นาที * 60 นาที)
    var minutes = Math.floor((elapsedTime % 3600000) / 60000); // 60000 มาจาก 1000 * 60 (1000 มิลลิวินาที * 60 นาที)
    var seconds = Math.floor((elapsedTime % 60000) / 1000); // 1000 มาจาก 1000 มิลลิวินาที

    var formattedTime = padNumber(hours) + ":" + padNumber(minutes) + ":" + padNumber(seconds);
    document.getElementById("timeDisplay").textContent = "เวลาที่ผ่านไป: " + formattedTime;
}

function padNumber(number) {
    return (number < 10 ? "0" : "") + number;
}